04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/forcedUpstreamWave/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (2 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    left
    {
        type            fixedValue;
        value           $internalField;
    }

    right
    {
        type            outletPhaseMeanVelocity;
        UnMean          2;
        alpha           alpha.water;
    }

    top
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity  uniform (2 0 0);
    }

    bottom
    {
        type            noSlip;
    }
}


// ************************************************************************* //
